  ### Deployment Results ✅

  **jcetina** successfully **noop** deployed branch `jcetina/add-nat-gw` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/91169a15-379d-4bbc-8d26-d62066216bd4/terraform-bin plan -no-color -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

# azurerm_linux_virtual_machine.examserverple will be destroyed
# (because azurerm_linux_virtual_machine.examserverple is not in configuration)
- resource "azurerm_linux_virtual_machine" "examserverple" {
    - admin_username                  = "adminuser" -> null
    - allow_extension_operations      = true -> null
    - computer_name                   = "server" -> null
    - disable_password_authentication = true -> null
    - encryption_at_host_enabled      = false -> null
    - extensions_time_budget          = "PT1H30M" -> null
    - id                              = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/server" -> null
    - location                        = "eastus" -> null
    - max_bid_price                   = -1 -> null
    - name                            = "server" -> null
    - network_interface_ids           = [
        - "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/server-nic",
      ] -> null
    - patch_mode                      = "ImageDefault" -> null
    - platform_fault_domain           = -1 -> null
    - priority                        = "Regular" -> null
    - private_ip_address              = "10.0.1.4" -> null
    - private_ip_addresses            = [
        - "10.0.1.4",
      ] -> null
    - provision_vm_agent              = true -> null
    - public_ip_addresses             = [] -> null
    - resource_group_name             = "org-jcetina-repo-baklava-rg" -> null
    - secure_boot_enabled             = false -> null
    - size                            = "Standard_F2" -> null
    - tags                            = {} -> null
    - virtual_machine_id              = "1fe501ed-1b38-40c1-9236-d967acc81a83" -> null
    - vtpm_enabled                    = false -> null

    - admin_ssh_key {
        - public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDAL5gepLTmUuvBvGN+PwrdliXVyU0UKUz0CBYrdQWg6fPF8TAmQ/lrLZzaxopzHYFU5rDyK8ZtL1TzLEEtyGboWizmotiQEQuLpS8hrpDJMwTbLnjiekaUpR1YfAL2Xo4ridCvKmoBquxnLgtWEnlPPUwU8IZ2WSp8ok9YzdsyoJik3NmhvaF9eunq8oOW6x6bfdlXDxt+OM4DAQphKOMDwUFAhi3DAc2SPDrssTVo2il/5K1zmZNLobjwRKp7kiFTzaPXdcRDCZ0w+jccv0o8KH01IACgCBvUgmU6Sv+BrsakPVsnKnA1C7uE/mOe9Ofyz2qv6nrsnXF+KdRIzqJlcJ2r++qQtRg8MTiNxJAQ5neo2JC+X35np2Lkc9nY5mejO19JhXh7sXnQYpaJfZnSHAli4teICgmgtFFOadQJ3IP03PHUPy668S/ToktZ5tJLX4+ISERUt87OYzZ0rrOLbXW9ia4VKlbkVOkUh3WcOBvgotFIB6IPRpAhnBl8GmE=
          EOT -> null
        - username   = "adminuser" -> null
      }

    - os_disk {
        - caching                   = "ReadWrite" -> null
        - disk_size_gb              = 30 -> null
        - name                      = "server_OsDisk_1_bfcda8d757f041c4a69e4b21c9a80959" -> null
        - storage_account_type      = "Standard_LRS" -> null
        - write_accelerator_enabled = false -> null
      }

    - source_image_reference {
        - offer     = "0001-com-ubuntu-server-focal" -> null
        - publisher = "Canonical" -> null
        - sku       = "20_04-lts" -> null
        - version   = "latest" -> null
      }
  }

# azurerm_linux_virtual_machine.servers[0] will be created
+ resource "azurerm_linux_virtual_machine" "servers" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus"
    + max_bid_price                   = -1
    + name                            = "server-0"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDAL5gepLTmUuvBvGN+PwrdliXVyU0UKUz0CBYrdQWg6fPF8TAmQ/lrLZzaxopzHYFU5rDyK8ZtL1TzLEEtyGboWizmotiQEQuLpS8hrpDJMwTbLnjiekaUpR1YfAL2Xo4ridCvKmoBquxnLgtWEnlPPUwU8IZ2WSp8ok9YzdsyoJik3NmhvaF9eunq8oOW6x6bfdlXDxt+OM4DAQphKOMDwUFAhi3DAc2SPDrssTVo2il/5K1zmZNLobjwRKp7kiFTzaPXdcRDCZ0w+jccv0o8KH01IACgCBvUgmU6Sv+BrsakPVsnKnA1C7uE/mOe9Ofyz2qv6nrsnXF+KdRIzqJlcJ2r++qQtRg8MTiNxJAQ5neo2JC+X35np2Lkc9nY5mejO19JhXh7sXnQYpaJfZnSHAli4teICgmgtFFOadQJ3IP03PHUPy668S/ToktZ5tJLX4+ISERUt87OYzZ0rrOLbXW9ia4VKlbkVOkUh3WcOBvgotFIB6IPRpAhnBl8GmE=
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# azurerm_linux_virtual_machine.servers[1] will be created
+ resource "azurerm_linux_virtual_machine" "servers" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus"
    + max_bid_price                   = -1
    + name                            = "server-1"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDAL5gepLTmUuvBvGN+PwrdliXVyU0UKUz0CBYrdQWg6fPF8TAmQ/lrLZzaxopzHYFU5rDyK8ZtL1TzLEEtyGboWizmotiQEQuLpS8hrpDJMwTbLnjiekaUpR1YfAL2Xo4ridCvKmoBquxnLgtWEnlPPUwU8IZ2WSp8ok9YzdsyoJik3NmhvaF9eunq8oOW6x6bfdlXDxt+OM4DAQphKOMDwUFAhi3DAc2SPDrssTVo2il/5K1zmZNLobjwRKp7kiFTzaPXdcRDCZ0w+jccv0o8KH01IACgCBvUgmU6Sv+BrsakPVsnKnA1C7uE/mOe9Ofyz2qv6nrsnXF+KdRIzqJlcJ2r++qQtRg8MTiNxJAQ5neo2JC+X35np2Lkc9nY5mejO19JhXh7sXnQYpaJfZnSHAli4teICgmgtFFOadQJ3IP03PHUPy668S/ToktZ5tJLX4+ISERUt87OYzZ0rrOLbXW9ia4VKlbkVOkUh3WcOBvgotFIB6IPRpAhnBl8GmE=
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# azurerm_network_interface.server will be destroyed
# (because azurerm_network_interface.server is not in configuration)
- resource "azurerm_network_interface" "server" {
    - applied_dns_servers           = [] -> null
    - dns_servers                   = [] -> null
    - enable_accelerated_networking = false -> null
    - enable_ip_forwarding          = false -> null
    - id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/server-nic" -> null
    - internal_domain_name_suffix   = "ifatwhs3bgpu5ljl3uylxrs2xc.bx.internal.cloudapp.net" -> null
    - location                      = "eastus" -> null
    - mac_address                   = "00-22-48-31-BC-AA" -> null
    - name                          = "server-nic" -> null
    - private_ip_address            = "10.0.1.4" -> null
    - private_ip_addresses          = [
        - "10.0.1.4",
      ] -> null
    - resource_group_name           = "org-jcetina-repo-baklava-rg" -> null
    - tags                          = {} -> null
    - virtual_machine_id            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/server" -> null

    - ip_configuration {
        - name                          = "internal" -> null
        - primary                       = true -> null
        - private_ip_address            = "10.0.1.4" -> null
        - private_ip_address_allocation = "Dynamic" -> null
        - private_ip_address_version    = "IPv4" -> null
        - subnet_id                     = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/ServerSubnet" -> null
      }
  }

# azurerm_network_interface.servers[0] will be created
+ resource "azurerm_network_interface" "servers" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "eastus"
    + mac_address                   = (known after apply)
    + name                          = "server-nic-0"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + subnet_id                                          = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/ServerSubnet"
      }
  }

# azurerm_network_interface.servers[1] will be created
+ resource "azurerm_network_interface" "servers" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "eastus"
    + mac_address                   = (known after apply)
    + name                          = "server-nic-1"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + subnet_id                                          = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/ServerSubnet"
      }
  }

# module.server_subnet.azurerm_subnet.subnet will be updated in-place
~ resource "azurerm_subnet" "subnet" {
    ~ address_prefixes                               = [
        - "10.0.1.0/24",
        + "10.0.2.0/24",
      ]
      id                                             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/ServerSubnet"
      name                                           = "ServerSubnet"
      # (6 unchanged attributes hidden)
  }

# module.vnet.azurerm_bastion_host.bastion will be created
+ resource "azurerm_bastion_host" "bastion" {
    + copy_paste_enabled     = true
    + dns_name               = (known after apply)
    + file_copy_enabled      = false
    + id                     = (known after apply)
    + ip_connect_enabled     = false
    + location               = "eastus"
    + name                   = "my-secure-vnet-bastion"
    + resource_group_name    = "org-jcetina-repo-baklava-rg"
    + scale_units            = 2
    + shareable_link_enabled = false
    + sku                    = "Basic"
    + tunneling_enabled      = false

    + ip_configuration {
        + name                 = "bastion-config"
        + public_ip_address_id = (known after apply)
        + subnet_id            = (known after apply)
      }
  }

# module.vnet.azurerm_subnet_nat_gateway_association.firewall_association must be replaced
-/+ resource "azurerm_subnet_nat_gateway_association" "firewall_association" {
    ~ id             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/AzureFirewallSubnet" -> (known after apply)
    ~ subnet_id      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/AzureFirewallSubnet" -> (known after apply) # forces replacement
      # (1 unchanged attribute hidden)
  }

# module.vnet.module.bastion_ip.azurerm_public_ip.public_ip will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus"
    + name                    = "my-secure-vnet-bastion-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
  }

# module.vnet.module.bastion_subnet.azurerm_subnet.subnet will be created
+ resource "azurerm_subnet" "subnet" {
    + address_prefixes                               = [
        + "10.0.0.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "AzureBastionSubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "my-secure-vnet"
  }

# module.vnet.module.firewall.azurerm_firewall.firewall must be replaced
-/+ resource "azurerm_firewall" "firewall" {
    - dns_servers         = [] -> null
    ~ id                  = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/azureFirewalls/my-secure-firewall" -> (known after apply)
      name                = "my-secure-firewall"
    - private_ip_ranges   = [] -> null
    - tags                = {} -> null
    ~ threat_intel_mode   = "Alert" -> (known after apply)
    - zones               = [] -> null
      # (5 unchanged attributes hidden)

    ~ ip_configuration {
          name                 = "my-secure-firewall-ip-config"
        ~ private_ip_address   = "10.0.0.4" -> (known after apply)
        ~ subnet_id            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/AzureFirewallSubnet" -> (known after apply) # forces replacement
          # (1 unchanged attribute hidden)
      }
  }

# module.vnet.module.firewall_subnet.azurerm_subnet.subnet will be created
+ resource "azurerm_subnet" "subnet" {
    + address_prefixes                               = [
        + "10.0.1.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "AzureFirewallSubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "my-secure-vnet"
  }

# module.vnet.module.route_table.azurerm_route_table.route_table will be updated in-place
~ resource "azurerm_route_table" "route_table" {
      id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/routeTables/my-secure-route-table"
      name                          = "my-secure-route-table"
    ~ route                         = [
        - {
            - address_prefix         = "0.0.0.0/0"
            - name                   = "ToFirewall"
            - next_hop_in_ip_address = "10.0.0.4"
            - next_hop_type          = "VirtualAppliance"
          },
        - {
            - address_prefix         = "10.0.0.0/16"
            - name                   = "VnetRoute"
            - next_hop_in_ip_address = ""
            - next_hop_type          = "VnetLocal"
          },
        + {
            + address_prefix         = "10.0.0.0/16"
            + name                   = "VnetRoute"
            + next_hop_in_ip_address = null
            + next_hop_type          = "VnetLocal"
          },
          # (1 unchanged element hidden)
      ]
      tags                          = {}
      # (4 unchanged attributes hidden)
  }

# module.vnet.module.subnet.azurerm_subnet.subnet will be destroyed
# (because azurerm_subnet.subnet is not in configuration)
- resource "azurerm_subnet" "subnet" {
    - address_prefixes                               = [
        - "10.0.0.0/24",
      ] -> null
    - enforce_private_link_endpoint_network_policies = false -> null
    - enforce_private_link_service_network_policies  = false -> null
    - id                                             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/AzureFirewallSubnet" -> null
    - name                                           = "AzureFirewallSubnet" -> null
    - resource_group_name                            = "org-jcetina-repo-baklava-rg" -> null
    - service_endpoint_policy_ids                    = [] -> null
    - service_endpoints                              = [] -> null
    - virtual_network_name                           = "my-secure-vnet" -> null
  }

Plan: 10 to add, 2 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

  </details>